profiling/results/stage-4_wrk_put.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.104ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.153ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.02ms    1.41ms  26.10ms   92.19%
    Req/Sec   528.75    117.71     1.60k    77.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.75ms
 75.000%    2.30ms
 90.000%    2.96ms
 99.000%    8.69ms
 99.900%   14.67ms
 99.990%   22.78ms
 99.999%   26.11ms
100.000%   26.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.228     0.000000            1         0.00
       0.984     0.100000         5015 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.202     0.200000        10003         0.00
       1.386     0.300000        14991        -0.00
       1.564     0.400000        20002        -0.00
       1.748     0.500000        25002         0.00
       1.845     0.550000        27513 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.945     0.600000        30001         0.00
       2.051     0.650000        32486        -0.00
       2.171     0.700000        34980        -0.00
       2.303     0.750000        37483         0.00
       2.379     0.775000        38757 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.461     0.800000        39991         0.00
       2.553     0.825000        41236        -0.00
       2.657     0.850000        42491        -0.00
       2.781     0.875000        43725         0.00
       2.861     0.887500        44349 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       2.957     0.900000        44979         0.00
       3.071     0.912500        45600        -0.00
       3.241     0.925000        46224        -0.00
       3.511     0.937500        46848         0.00
       3.691     0.943750        47159 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       3.931     0.950000        47471         -nan
       4.235     0.956250        47784        -0.00
       4.591     0.962500        48096        -0.00
       5.095     0.968750        48408         0.00
       5.427     0.971875        48565 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       5.787     0.975000        48722         -nan
       6.211     0.978125        48876        -0.00
       6.779     0.981250        49034        -0.00
       7.335     0.984375        49190         0.00
       7.655     0.985938        49268 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       7.987     0.987500        49345         0.00
       8.415     0.989062        49424        -0.00
       8.847     0.990625        49503        -0.00
       9.327     0.992188        49579         0.00
       9.559     0.992969        49618 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
       9.871     0.993750        49658         0.00
      10.151     0.994531        49697        -0.00
      10.583     0.995313        49735        -0.00
      11.103     0.996094        49775         0.00
      11.295     0.996484        49794 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      11.519     0.996875        49813         -nan
      11.911     0.997266        49833        -0.00
      12.295     0.997656        49852        -0.00
      12.823     0.998047        49873         0.00
      13.039     0.998242        49882 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      13.511     0.998437        49891         -nan
      13.839     0.998633        49901        -0.00
      14.207     0.998828        49911        -0.00
      14.799     0.999023        49921         0.00
      15.215     0.999121        49926 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      15.367     0.999219        49930         0.00
      15.839     0.999316        49935        -0.00
      16.151     0.999414        49940        -0.00
      16.959     0.999512        49945         0.00
      17.439     0.999561        49948 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      17.951     0.999609        49950         0.00
      18.191     0.999658        49952        -0.00
      18.527     0.999707        49955        -0.00
      19.855     0.999756        49957         0.00
      20.303     0.999780        49959 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      21.135     0.999805        49960         -nan
      21.295     0.999829        49961        -0.00
      21.679     0.999854        49962        -0.00
      22.111     0.999878        49963         0.00
      22.783     0.999890        49965 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      22.783     0.999902        49965         -nan
      22.783     0.999915        49965        -0.00
      23.583     0.999927        49966        -0.00
      23.583     0.999939        49966         0.00
      24.207     0.999945        49968 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      24.207     0.999951        49968         0.00
      24.207     0.999957        49968        -0.00
      24.207     0.999963        49968        -0.00
      24.207     0.999969        49968         0.00
      24.207     0.999973        49968 1197515777994123122827113180149268934166040916797761874901295891084783746657345444054174008110143315617531302687800938125050062129397660703838339185309575766350416028682216846776156215216348189439851718800547092882496686463674426196563591168.00
      24.207     0.999976        49968         0.00
      24.207     0.999979        49968        -0.00
      26.111     0.999982        49969        -0.00
      26.111     1.000000        49969         0.00
#[Mean    =        2.021, StdDeviation   =        1.410]
#[Max     =       26.096, Total count    =        49969]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  59989 requests in 1.00m, 4.75MB read
Requests/sec:    999.83
Transfer/sec:     81.04KB